# Use pandas for feature encoding
---

In [14]:
import pandas as pd 
import numpy as np 
import seaborn as sns

In [15]:
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### pandas get dummies function

In [16]:
pd.get_dummies(df['day'])

      Thur    Fri    Sat    Sun
0    False  False  False   True
1    False  False  False   True
2    False  False  False   True
3    False  False  False   True
4    False  False  False   True
..     ...    ...    ...    ...
239  False  False   True  False
240  False  False   True  False
241  False  False   True  False
242  False  False   True  False
243   True  False  False  False

[244 rows x 4 columns]

In [17]:
pd.get_dummies(df['day'], drop_first = True)

       Fri    Sat    Sun
0    False  False   True
1    False  False   True
2    False  False   True
3    False  False   True
4    False  False   True
..     ...    ...    ...
239  False   True  False
240  False   True  False
241  False   True  False
242  False   True  False
243  False  False  False

[244 rows x 3 columns]

In [18]:
get_dummies = pd.get_dummies(df, columns = ['day'])
get_dummies.head()

,total_bill,tip,sex,smoker,time,size,day_Thur,day_Fri,day_Sat,day_Sun
0,16.99,1.01,Female,No,Dinner,2,False,False,False,True
1,10.34,1.66,Male,No,Dinner,3,False,False,False,True
2,21.01,3.50,Male,No,Dinner,3,False,False,False,True
3,23.68,3.31,Male,No,Dinner,2,False,False,False,True
4,24.59,3.61,Female,No,Dinner,4,False,False,False,True

In [19]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [20]:
df = pd.get_dummies(df, columns = ['day'], drop_first = True)
df.head()

   total_bill   tip     sex smoker    time  size  day_Fri  day_Sat  day_Sun
0       16.99  1.01  Female     No  Dinner     2    False    False     True
1       10.34  1.66    Male     No  Dinner     3    False    False     True
2       21.01  3.50    Male     No  Dinner     3    False    False     True
3       23.68  3.31    Male     No  Dinner     2    False    False     True
4       24.59  3.61  Female     No  Dinner     4    False    False     True